In [1]:
import pandas as pd

In [2]:
pd.__version__

'0.23.4'

In [3]:
d = pd.read_html('https://www.bankrate.com/cd.aspx')

In [4]:
type(d)

list

In [5]:
len(d)

5

In [6]:
df = d[0]
df

  CD Term CD Rate National Average
0  1-year                    0.96%
1  2-year                    1.15%
2  3-year                    1.23%
3  4-year                    1.33%
4  5-year                    1.49%

In [7]:
d[1]

        Term                Bank CD Rate (APY) Minimum Deposit
0   6 months     Citizens Access         2.35%          $5,000
1     1 year           Ally Bank         2.75%              $0
2  18 months         Capital One         2.70%              $0
3    2 years     Citizens Access         2.95%          $5,000
4    3 years         Capital One         2.85%              $0
5    4 years            Vio Bank         3.10%            $500
6    5 years  Goldman Sachs Bank         3.10%            $500

In [8]:
d[3]

        Term    APY Minimum Deposit
0   6 months  0.60%            $500
1   9 months  0.70%            $500
2  12 months  2.75%            $500
3  18 months  2.65%            $500
4  24 months  2.70%            $500
5    3 years  2.75%            $500
6    4 years  2.80%            $500
7    5 years  3.10%            $500

In [9]:
d[4]

        Term    APY Minimum Deposit
0   6 months  2.20%          $2,500
1  12 months  2.70%          $2,500
2  18 months  2.75%          $2,500
3  24 months  2.80%          $2,500
4    3 years  2.85%          $2,500
5    4 years  2.90%          $2,500
6    5 years  3.05%          $2,500